Open from plan against dev locally

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following   
symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.mya_application_dev.azurerm_cosmosdb_account.nbs_mya_cosmos_db will be updated in-place
  ~ resource "azurerm_cosmosdb_account" "nbs_mya_cosmos_db" {
      ~ analytical_storage_enabled               = false -> true
        id                                       = "/subscriptions/07748954-52d6-46ce-95e6-2701bfc715b4/resourceGroups/nbs-mya-rg-dev-uks/providers/Microsoft.DocumentDB/databaseAccounts/nbs-mya-cdb-dev-uks"
        name                                     = "nbs-mya-cdb-dev-uks"
        tags                                     = {}
        # (30 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.mya_application_dev.azurerm_cosmosdb_sql_container.nbs_mya_audit_container will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "nbs_mya_audit_container" {
      + analytical_storage_ttl = -1
        id                     = "/subscriptions/07748954-52d6-46ce-95e6-2701bfc715b4/resourceGroups/nbs-mya-rg-dev-uks/providers/Microsoft.DocumentDB/databaseAccounts/nbs-mya-cdb-dev-uks/sqlDatabases/appts/containers/audit_data"
        name                   = "audit_data"
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.mya_application_dev.azurerm_cosmosdb_sql_container.nbs_mya_booking_container will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "nbs_mya_booking_container" {
      + analytical_storage_ttl = -1
        id                     = "/subscriptions/07748954-52d6-46ce-95e6-2701bfc715b4/resourceGroups/nbs-mya-rg-dev-uks/providers/Microsoft.DocumentDB/databaseAccounts/nbs-mya-cdb-dev-uks/sqlDatabases/appts/containers/booking_data"
        name                   = "booking_data"
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.mya_application_dev.azurerm_cosmosdb_sql_container.nbs_mya_core_container will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "nbs_mya_core_container" {
      + analytical_storage_ttl = -1
        id                     = "/subscriptions/07748954-52d6-46ce-95e6-2701bfc715b4/resourceGroups/nbs-mya-rg-dev-uks/providers/Microsoft.DocumentDB/databaseAccounts/nbs-mya-cdb-dev-uks/sqlDatabases/appts/containers/core_data"
        name                   = "core_data"
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.mya_application_dev.azurerm_cosmosdb_sql_container.nbs_mya_index_container will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "nbs_mya_index_container" {
      + analytical_storage_ttl = -1
        id                     = "/subscriptions/07748954-52d6-46ce-95e6-2701bfc715b4/resourceGroups/nbs-mya-rg-dev-uks/providers/Microsoft.DocumentDB/databaseAccounts/nbs-mya-cdb-dev-uks/sqlDatabases/appts/containers/index_data"
        name                   = "index_data"
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.mya_application_dev.azurerm_linux_web_app.nbs_mya_web_app_service will be updated in-place
  ~ resource "azurerm_linux_web_app" "nbs_mya_web_app_service" {
      ~ app_settings                                   = {
          ~ "AUTH_HOST"        = "https://nbs-mya-func-dev-uks.azurewebsites.net" -> null
          ~ "NBS_API_BASE_URL" = "https://nbs-mya-func-dev-uks.azurewebsites.net" -> null
            # (1 unchanged element hidden)
        }
        id                                             = "/subscriptions/07748954-52d6-46ce-95e6-2701bfc715b4/resourceGroups/nbs-mya-rg-dev-uks/providers/Microsoft.Web/sites/nbs-mya-app-dev-uks"
        name                                           = "nbs-mya-app-dev-uks"
        tags                                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.mya_application_dev.azurerm_storage_account.nbs_mya_synapse_workspace_storage_account[0] will be created
  + resource "azurerm_storage_account" "nbs_mya_synapse_workspace_storage_account" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "uksouth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "nbsmyastrgsynadevuks"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "nbs-mya-rg-dev-uks"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.mya_application_dev.azurerm_storage_data_lake_gen2_filesystem.nbs_mya_synapse_workspace_gen2_filesystem[0] will be created
  + resource "azurerm_storage_data_lake_gen2_filesystem" "nbs_mya_synapse_workspace_gen2_filesystem" {
      + default_encryption_scope = (known after apply)
      + group                    = (known after apply)
      + id                       = (known after apply)
      + name                     = "nbs-mya-genfs-dev-uks"
      + owner                    = (known after apply)
      + storage_account_id       = (known after apply)

      + ace (known after apply)
    }

  # module.mya_application_dev.azurerm_synapse_firewall_rule.nbs_mya_synapse_firewall[0] will be created
  + resource "azurerm_synapse_firewall_rule" "nbs_mya_synapse_firewall" {
      + end_ip_address       = "255.255.255.255"
      + id                   = (known after apply)
      + name                 = "allowAll"
      + start_ip_address     = "0.0.0.0"
      + synapse_workspace_id = (known after apply)
    }

  # module.mya_application_dev.azurerm_synapse_integration_runtime_azure.nbs_mya_synapse_runtime[0] will be created
  + resource "azurerm_synapse_integration_runtime_azure" "nbs_mya_synapse_runtime" {
      + compute_type         = "General"
      + core_count           = 8
      + id                   = (known after apply)
      + location             = "uksouth"
      + name                 = "nbsmyasynrundevuks"
      + synapse_workspace_id = (known after apply)
      + time_to_live_min     = 0
    }

  # module.mya_application_dev.azurerm_synapse_linked_service.nbs_mya_synapse_linked_service[0] will be created
  + resource "azurerm_synapse_linked_service" "nbs_mya_synapse_linked_service" {
      + id                   = (known after apply)
      + name                 = "nbsmyasynlsdevuks"
      + synapse_workspace_id = (known after apply)
      + type                 = "CosmosDb"
      + type_properties_json = (sensitive value)

      + integration_runtime {
          + name = "nbsmyasynrundevuks"
        }
    }

  # module.mya_application_dev.azurerm_synapse_spark_pool.nbs_mya_synapse_spark_pool[0] will be created
  + resource "azurerm_synapse_spark_pool" "nbs_mya_synapse_spark_pool" {
      + cache_size                          = 100
      + compute_isolation_enabled           = false
      + dynamic_executor_allocation_enabled = false
      + id                                  = (known after apply)
      + name                                = "myasynsdev"
      + node_count                          = (known after apply)
      + node_size                           = "Small"
      + node_size_family                    = "MemoryOptimized"
      + session_level_packages_enabled      = false
      + spark_events_folder                 = "/events"
      + spark_log_folder                    = "/logs"
      + spark_version                       = "3.4"
      + synapse_workspace_id                = (known after apply)

      + auto_pause {
          + delay_in_minutes = 15
        }

      + auto_scale {
          + max_node_count = 3
          + min_node_count = 3
        }

      + library_requirement {
          + content  = <<-EOT
                appnope==0.1.0
                beautifulsoup4==4.6.3
            EOT
          + filename = "requirements.txt"
        }

      + spark_config {
          + content  = <<-EOT
                spark.shuffle.spill                true
            EOT
          + filename = "config.txt"
        }
    }

  # module.mya_application_dev.azurerm_synapse_workspace.nbs_mya_synapse_workspace[0] will be created
  + resource "azurerm_synapse_workspace" "nbs_mya_synapse_workspace" {
      + azuread_authentication_only          = false
      + connectivity_endpoints               = (known after apply)
      + id                                   = (known after apply)
      + location                             = "uksouth"
      + managed_resource_group_name          = (known after apply)
      + name                                 = "nbsmyasynwdevuks"
      + public_network_access_enabled        = true
      + resource_group_name                  = "nbs-mya-rg-dev-uks"
      + sql_administrator_login              = "sqladminuser"
      + sql_administrator_login_password     = (sensitive value)
      + storage_data_lake_gen2_filesystem_id = (known after apply)
      + tags                                 = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.mya_application_dev.azurerm_windows_function_app.nbs_mya_http_func_app will be updated in-place
  ~ resource "azurerm_windows_function_app" "nbs_mya_http_func_app" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                      = (sensitive value)
          ~ "Auth__Providers__0__AuthorizeUri"                           = "https://login.microsoftonline.com/37c354b2-85b0-47f5-b222-07b48d774ee3/oauth2/authorize" -> null
          ~ "Auth__Providers__0__ChallengePhrase"                        = "ThisIsntRandomButItNeedsToBe43CharactersLong" -> null   
          ~ "Auth__Providers__0__ClientCodeExchangeUri"                  = "https://nbs-mya-app-dev-uks.azurewebsites.net/manage-your-appointments/auth/set-cookie?provider=nhs-mail" -> "/manage-your-appointments/auth/set-cookie?provider=nhs-mail"
          ~ "Auth__Providers__0__ClientId"                               = "19b20d08-797d-48dd-b239-1e017ff1b09a" -> null
          ~ "Auth__Providers__0__ClientSecret"                           = (sensitive value)
          ~ "Auth__Providers__0__Issuer"                                 = "https://sts.windows.net/37c354b2-85b0-47f5-b222-07b48d774ee3/" -> null
          ~ "Auth__Providers__0__JwksUri"                                = "https://login.microsoftonline.com/common/discovery/keys"
 -> null
          ~ "Auth__Providers__0__ReturnUri"                              = "https://nbs-mya-func-dev-uks.azurewebsites.net/api/auth-return" -> "/api/auth-return"
          ~ "Auth__Providers__0__TokenUri"                               = "https://login.microsoftonline.com/37c354b2-85b0-47f5-b222-07b48d774ee3/oauth2/token" -> null
          ~ "Auth__Providers__1__AuthorizeUri"                           = "https://nhsi-sandbox.oktapreview.com/oauth2/v1/authorize" -> null
          ~ "Auth__Providers__1__ChallengePhrase"                        = "ThisIsntRandomButItNeedsToBe43CharactersLong" -> null   
          ~ "Auth__Providers__1__ClientCodeExchangeUri"                  = "https://nbs-mya-app-dev-uks.azurewebsites.net/manage-your-appointments/auth/set-cookie?provider=okta" -> "/manage-your-appointments/auth/set-cookie?provider=okta"
          ~ "Auth__Providers__1__ClientId"                               = "0oa2bgjyja0Sh1TYt0h8" -> null
          ~ "Auth__Providers__1__ClientSecret"                           = (sensitive value)
          ~ "Auth__Providers__1__Issuer"                                 = "https://nhsi-sandbox.oktapreview.com" -> null
          ~ "Auth__Providers__1__JwksUri"                                = "https://nhsi-sandbox.oktapreview.com/oauth2/v1/keys" -> null
          ~ "Auth__Providers__1__ReturnUri"                              = "https://nbs-mya-func-dev-uks.azurewebsites.net/api/auth-return?provider=okta" -> "/api/auth-return?provider=okta"
          ~ "Auth__Providers__1__TokenUri"                               = "https://nhsi-sandbox.oktapreview.com/oauth2/v1/token" ->
 null
          ~ "SPLUNK_HEC_TOKEN"                                           = (sensitive value)
          ~ "SPLUNK_HOST_URL"                                            = "https://hec.splunk.aws.digital.nhs.uk/services/collector/event" -> null
            # (18 unchanged elements hidden)
        }
        id                                             = "/subscriptions/07748954-52d6-46ce-95e6-2701bfc715b4/resourceGroups/nbs-mya-rg-dev-uks/providers/Microsoft.Web/sites/nbs-mya-func-dev-uks"
        name                                           = "nbs-mya-func-dev-uks"
        tags                                           = {}
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string = (sensitive value) -> null
            # (30 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.mya_application_dev.azurerm_windows_function_app.nbs_mya_service_bus_func_app will be updated in-place
  ~ resource "azurerm_windows_function_app" "nbs_mya_service_bus_func_app" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                                = (sensitive value)
          ~ "GovNotifyApiKey"                                                      = (sensitive value)
          ~ "GovNotifyBaseUri"                                                     = "https://api.notifications.service.gov.uk" -> null
          ~ "SPLUNK_HEC_TOKEN"                                                     = (sensitive value)
          ~ "SPLUNK_HOST_URL"                                                      = "https://hec.splunk.aws.digital.nhs.uk/services/collector/event" -> null
            # (42 unchanged elements hidden)
        }
        id                                             = "/subscriptions/07748954-52d6-46ce-95e6-2701bfc715b4/resourceGroups/nbs-mya-rg-dev-uks/providers/Microsoft.Web/sites/nbs-mya-sbfunc-dev-uks"
        name                                           = "nbs-mya-sbfunc-dev-uks"
        tags                                           = {}
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string = (sensitive value) -> null
            # (30 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.mya_application_dev.azurerm_windows_function_app.nbs_mya_timer_func_app will be updated in-place
  ~ resource "azurerm_windows_function_app" "nbs_mya_timer_func_app" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                                = (sensitive value)
          ~ "BookingRemindersCronSchedule"                                         = "0 0 8 * * *" -> null
          ~ "GovNotifyApiKey"                                                      = (sensitive value)
          ~ "GovNotifyBaseUri"                                                     = "https://api.notifications.service.gov.uk" -> null
          ~ "SPLUNK_HEC_TOKEN"                                                     = (sensitive value)
          ~ "SPLUNK_HOST_URL"                                                      = "https://hec.splunk.aws.digital.nhs.uk/services/collector/event" -> null
          ~ "UnconfirmedProvisionalBookingsCronSchedule"                           = "0 */5 * * * *" -> null
            # (45 unchanged elements hidden)
        }
        id                                             = "/subscriptions/07748954-52d6-46ce-95e6-2701bfc715b4/resourceGroups/nbs-mya-rg-dev-uks/providers/Microsoft.Web/sites/nbs-mya-timerfunc-dev-uks"
        name                                           = "nbs-mya-timerfunc-dev-uks"
        tags                                           = {}
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string = (sensitive value) -> null
            # (30 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 7 to add, 9 to change, 0 to destroy.